IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType
Check result type

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Capacity
calculation of capacity by the interaction diagram

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Response
calculation plane of deformation

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Shear
shear check

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Torsion
torsion check

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Interaction
interaction shear+torsion

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Fatigue
calculation - response for fatigue

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.StressLimitation
stress limitation check

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.CrackWidth
crack width check

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Detailing
detailing check

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Stiffness
stiffness

IdeaRS.OpenModel.Concrete.CheckResult.CheckResultType.Deflection
deflection